# --- НАСТРОЙКИ СЕРВЕРА ---
AUDIT_LOG_CHANNEL_ID = 111222333444  # ID КАНАЛА ЛОГОВ АУДИТА
MAX_ALLOWED_ROLE_ID = 1522673315775512587   # ВЫШЕ ЭТОЙ РОЛИ ПЕРЕДАВАТЬ НЕЛЬЗЯ

# --- НАСТРОЙКИ РУЧНОГО ЗАПОЛНЕНИЯ ПРИ ОДОБРЕНИИ ---
VERDICTS = {
    "Получение гражданства": {
        "label": "Введите Новое РП ФИО и Возраст",
        "placeholder": "Например: Джеймс Милтон, 25 лет...",
        "db_field": "passport_data",
        "authority": "УМВД по г. Милтон"
    },
    "Лицензия": {
        "label": "Укажите Тип и Категорию прав",
        "placeholder": "Например: На легковую технику (Кат. B)...",
        "db_field": "license_data",
        "authority": "МРЭО ГАИ"
    },
    "Регистрация брака": {
        "label": "Введите ФИО Мужа и Жены",
        "placeholder": "Например: Джеймс Милтон и Алиса Милтон...",
        "db_field": "married_data",
        "authority": "Центральный ЗАГС"
    }
}

# --- СПИСОК 7 КАТЕГОРИЙ И ИХ УНИКАЛЬНЫХ ВОПРОСОВ ---
CATEGORIES = {
    "Заявление на гражданина": {
        "description": "Жалобы, иски и заявления на правонарушителей",
        "emoji": "⚖️",
        "role_id": 1523081088610599043,
        "fields": [
            {"label": "Имя Фамилия Нарушителя", "placeholder": "Ник нарушителя (Имя_Фамилия)...", "style": "short", "required": True},
            {"label": "Что именно произошло?", "placeholder": "Опишите подробно ситуацию...", "style": "paragraph", "required": True}
        ]
    },
    "Получение лидерской должности": {
        "description": "Подача анкет на лидерство в организациях",
        "emoji": "👑",
        "role_id": 1523081532804300930,
        "fields": [
            {"label": "Желаемая организация", "placeholder": "Какую фракцию хотите возглавить?", "style": "short", "required": True},
            {"label": "Ваш опыт и планы", "placeholder": "Были ли лидером раньше? Ваши улучшения...", "style": "paragraph", "required": True}
        ]
    },
    "Регистрация брака": {
        "description": "Подача заявления в ЗАГС на заключение брака",
        "emoji": "💍",
        "role_id": 1523079704007934123,
        "fields": [
            {"label": "РП ник Вашего партнера", "placeholder": "Ник будущей(-го) супруги(-а)...", "style": "short", "required": True},
            {"label": "Желаемая дата церемонии", "placeholder": "Укажите удобную дату и время...", "style": "short", "required": False}
        ]
    },
    "Получение гражданства": {
        "description": "Анкеты для миграционной службы / новичков",
        "emoji": "🌍",
        "role_id": 1523079704007934123,
        "fields": [
            {"label": "Откуда вы прибыли в наш штат?", "placeholder": "Название вашего прошлого города...", "style": "short", "required": True},
            {"label": "Цель получения гражданства", "placeholder": "Зачем вам паспорт? Планы на работу...", "style": "paragraph", "required": True}
        ]
    },
    "Смена фамилии": {
        "description": "Изменение личных паспортных данных (Пошлина: 1000$)",
        "emoji": "👤",
        "role_id": 1523079704007934123,
        "fields": [
            {"label": "Желаемые новые Имя_Фамилия", "placeholder": "На какой ник хотите сменить?", "style": "short", "required": True},
            {"label": "Причина изменения данных", "placeholder": "РП причина (свадьба, скрытие от закона...)", "style": "paragraph", "required": True}
        ]
    },
    "Регистрация бизнеса": {
        "description": "Внесение коммерческого предприятия в гос. реестр",
        "emoji": "💼",
        "role_id": 1523079889777856532,
        "fields": [
            {"label": "Название и тип коммерции", "placeholder": "Например: Магазин одежды...", "style": "short", "required": True},
            {"label": "План развития бизнеса", "placeholder": "Чем именно будет заниматься предприятие...", "style": "paragraph", "required": True}
        ]
    },
    "Лицензия": {
        "description": "Заявления на получение лицензий (оружие, вождение...)",
        "emoji": "🪪",
        "role_id": 1523264971557961789,
        "fields": [
            {"label": "Какая лицензия вам необходима?", "placeholder": "На оружие / на вождение автобуса...", "style": "short", "required": True},
            {"label": "Пройден ли медицинский осмотр?", "placeholder": "Да/Нет (Если да, укажите дату)...", "style": "short", "required": True}
        ]
    }
}
